/* automatically generated by rust-bindgen */

#[repr(C)]
pub struct __half {
    pub __x: ::std::os::raw::c_ushort,
}
#[test]
fn bindgen_test_layout___half() {
    assert_eq!(
        ::std::mem::size_of::<__half>(),
        2usize,
        concat!("Size of: ", stringify!(__half))
    );
    assert_eq!(
        ::std::mem::align_of::<__half>(),
        2usize,
        concat!("Alignment of ", stringify!(__half))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__half>())).__x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__half),
            "::",
            stringify!(__x)
        )
    );
}
#[repr(C)]
pub struct __half2 {
    pub x: __half,
    pub y: __half,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout___half2() {
    assert_eq!(
        ::std::mem::size_of::<__half2>(),
        4usize,
        concat!("Size of: ", stringify!(__half2))
    );
    assert_eq!(
        ::std::mem::align_of::<__half2>(),
        4usize,
        concat!("Alignment of ", stringify!(__half2))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__half2>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__half2),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__half2>())).y as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(__half2),
            "::",
            stringify!(y)
        )
    );
}
